InformationRegisters/Дерби.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>Дерби</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Противник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Дерби/Ext/ManagerModule.bsl
Функция Создать(ДанныеЗаполнения) Экспорт
	Запись = РегистрыСведений.Дерби.СоздатьМенеджерЗаписи();
	Запись.Команда		= ДанныеЗаполнения.Команда;
	Запись.Противник	= ДанныеЗаполнения.Противник;
	Запись.Прочитать();
	Если НЕ Запись.Выбран() Тогда
		ЗаполнитьЗначенияСвойств(Запись, ДанныеЗаполнения);
		Попытка
			Запись.Записать();
		Исключение
			Возврат ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;
	Возврат "";
КонецФункции
